lwray-renesas/Metrology_NPL_3Ph4W/src/rl78i1c/application/debug/command.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products.
 * No other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIESREGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
 * NON-INFRINGEMENT.  ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY
 * LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE FOR ANY DIRECT,
 * INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR
 * ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability
 * of this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2013, 2015 Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/

/***********************************************************************************************************************
 * File Name    : command.c
 * Version      : 1.00
 * Device(s)    : RL78/I1C
 * Tool-Chain   :
 * H/W Platform : RL78/I1C Energy Meter Platform
 * Description  : Command processing source File
 ***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
 ***********************************************************************************************************************/
/* Driver */
#include "r_cg_macrodriver.h"   /* CG Macro Driver */
#include "r_cg_rtc.h"           /* RTC Driver */
#include "r_cg_dsadc.h"         /* DSAD Driver */
#include "r_cg_wdt.h"           /* WDT Driver */
#include "r_cg_lvd.h"

/* Wrapper */
#include "wrp_em_sw_config.h"   /* EM Software Config */
#include "wrp_em_sw_property.h"

/* MW/Core, Common */
#include "em_core.h"            /* EM Core APIs */

/* Application */
#include "config_format.h"      /* DATALFLASH Format */
#include "eeprom.h"             /* EEPROM Driver */
#include "dataflash.h"          /* DATALFLASH Driver */
#include "config_storage.h"     /* Storage Header File */
#include "platform.h"
#include "inst_read.h"
#include "r_calib.h"
#include "storage_em.h"

/* Debug Only */
#ifdef __DEBUG
#include <stdio.h>          /* Standard IO */
#include <stdarg.h>         /* Variant argument */
#include <string.h>         /* String Standard Lib */
#include <stdlib.h>
#include <math.h>           /* Mathematic Standard Lib */
#include <limits.h>         /* Number limits definitions */
#include "cmd.h"            /* CMD Prompt Driver */

#ifdef METER_ENABLE_MEASURE_CPU_LOAD
#include "load_test.h"
#endif

#endif

#ifdef __DEBUG

/***********************************************************************************************************************
Typedef definitions
 ***********************************************************************************************************************/
/* Command Invoker Function */
typedef uint8_t (*FUNC)(uint8_t *arg_str);

/* Command Item */
typedef struct tagCommandTable
{
	const uint8_t   *cmd_name;
	const uint8_t   *params;
	const uint8_t   *description;
	const FUNC      func;
} COMMAND_ITEM;

/***********************************************************************************************************************
Macro definitions
 ***********************************************************************************************************************/
/* Common macro */
#define     _BCD2DEC(x)     {x = (x & 0xF) + (x >> 4) * 10;}                /* 1 byte BCD to DEC Conversion */
#define     _DEC2BCD(x)     {x = (x % 10 ) | (((x / 10) << 4) & 0xF0);}     /* 1 byte DEC to BCD Conversion */

/* Command Status */
#define COMMAND_OK          0
#define COMMAND_ERROR       1

/* Command Invoker Statement & Table Length */
#define INVOKE_COMMAND(index, arg_str)  {                                                   \
		if (cmd_table[index].func != NULL)              \
		{                                               \
			(*cmd_table[index].func)(arg_str);          \
		}                                               \
}
#define COMMAND_TABLE_LENGTH    (sizeof(cmd_table) / sizeof(COMMAND_ITEM))

/***********************************************************************************************************************
Imported global variables and functions (from other files)
 ******************************************************************************/
/* Import from dataflash */
extern uint8_t DATAFLASH_ReadHeaderStatus(uint8_t block, uint8_t *buf);
extern uint8_t DATAFLASH_ReadHeaderCRC(uint8_t bank, uint8_t *buf);
extern uint8_t DATAFLASH_InternalRead(uint32_t addr, uint8_t* buf, uint16_t size);

/* Import from Wrapper */
extern volatile uint16_t g_wrp_sample_count;
extern int16_t  g_wrp_sample_int16[6][EM_ADC_MAX_DEBUG_SAMPLE];
extern int32_t  g_wrp_sample_int32[4][EM_ADC_MAX_DEBUG_SAMPLE];
extern EM_SW_SAMP_TYPE phase1_inversion_flag;
extern EM_SW_SAMP_TYPE phase2_inversion_flag;
extern EM_SW_SAMP_TYPE phase3_inversion_flag;
extern EM_SW_SAMP_TYPE neutral_inversion_flag;

/******************************************************************************
Exported global variables and functions (to be accessed by other files)
 ******************************************************************************/

