lwray-renesas/Metrology_NPL_3Ph4W/src/rl78i1c/application/debug/command.c
/******************************************************************************
Private global variables and functions
 ******************************************************************************/
/* Sub-function (static for module) */
static uint8_t * COMMAND_GetScanOneParam(
		uint8_t *output,
		uint16_t size,
		uint8_t *input,
		uint8_t *ahead_str,
		uint8_t *break_str
);
/* Command Invoker */
static uint8_t COMMAND_InvokeUsage(uint8_t *arg_str);                           /* Usage */
static uint8_t COMMAND_InvokeStartEM(uint8_t *arg_str);                         /* Start EM */
static uint8_t COMMAND_InvokeStopEM(uint8_t *arg_str);                          /* Stop EM */
static uint8_t COMMAND_InvokeRestartEM(uint8_t *arg_str);                       /* Restart EM */
static uint8_t COMMAND_InvokeDisplay(uint8_t *arg_str);                         /* Display */
static uint8_t COMMAND_InvokeDisplayBin(uint8_t *arg_str);                      /* Display (Raw Binary)*/
static uint8_t COMMAND_InvokeEnergyReset(uint8_t *arg_str);                     /* Resets live energy data and energy log*/
static uint8_t COMMAND_InvokeRtc(uint8_t *arg_str);                             /* RTC */
static uint8_t COMMAND_InvokeSetRtc(uint8_t *arg_str);                          /* Set RTC */
static uint8_t COMMAND_InvokeGetEnergyLog(uint8_t *arg_str);                    /* Get energy log */
static uint8_t COMMAND_InvokeBackup(uint8_t *arg_str);                          /* Backup */
static uint8_t COMMAND_InvokeRestore(uint8_t *arg_str);                         /* Restore */
static uint8_t COMMAND_InvokeReadMemory(uint8_t *arg_str);                      /* Read Memory */
static uint8_t COMMAND_InvokeWriteMemory(uint8_t *arg_str);                     /* Write Memory */
static uint8_t COMMAND_InvokeFormatMemory(uint8_t *arg_str);                    /* Format Memory */
static uint8_t COMMAND_InvokeReadDTFLHeader(uint8_t *arg_str);                  /* Read DTFL header */
static uint8_t COMMAND_InvokeEraseDTFL(uint8_t *arg_str);                       /* Erase DTFL content */
static uint8_t COMMAND_InvokeDumpSample(uint8_t *arg_str);                      /* Dump waveform samples */
static uint8_t COMMAND_InvokeCalibration(uint8_t *arg_str);                     /* Calibration */
static uint8_t COMMAND_InvokeGetCalibration(uint8_t *arg_str);                  /* Get Calibration Info */
static uint8_t COMMAND_InvokeSetConfig(uint8_t *arg_str);                       /* Set configuration */
static uint8_t COMMAND_InvokeCPULoad(uint8_t *arg_str);                         /* Measure CPU Load */
static uint8_t COMMAND_InvokeVddCheck(uint8_t *arg_str);                        /* Measure VDD Range using LVD */
static uint8_t COMMAND_InvokeInvertPolarity(uint8_t *arg_str);                  /* Inverts Polarity on current channel */

/* Command Table */
static const COMMAND_ITEM   cmd_table[] = 
{
		/* ---------------------------------------------------------------------------------------------------------------------*/
		/* Command Name     Parameter                   Description                                     Func Pointer */
		/* ---------------------------------------------------------------------------------------------------------------------*/
		{(const uint8_t *)"?"               ,   (const uint8_t *)""                                         ,   (const uint8_t *)"Help"                                                         ,   COMMAND_InvokeUsage                     },
		{(const uint8_t *)"cls"             ,   (const uint8_t *)""                                         ,   (const uint8_t *)"Clear screen"                                                 ,   NULL                                    },      /* CMD module processed it internally */
		{(const uint8_t *)"start"           ,   (const uint8_t *)""                                         ,   (const uint8_t *)"Start EM"                                                     ,   COMMAND_InvokeStartEM                   },
		{(const uint8_t *)"stop"            ,   (const uint8_t *)""                                         ,   (const uint8_t *)"Stop EM"                                                      ,   COMMAND_InvokeStopEM                    },
		{(const uint8_t *)"restart"         ,   (const uint8_t *)""                                         ,   (const uint8_t *)"Restart EM"                                                   ,   COMMAND_InvokeRestartEM                 },
		{(const uint8_t *)"display"         ,   (const uint8_t *)""                                         ,   (const uint8_t *)"Display current measured data"                                ,   COMMAND_InvokeDisplay                   },
		{(const uint8_t *)"displaybin"      ,   (const uint8_t *)""                                         ,   (const uint8_t *)"Display current measured data (Raw Binary)"                   ,   COMMAND_InvokeDisplayBin                },
		{(const uint8_t *)"energyreset"     ,   (const uint8_t *)""                                         ,   (const uint8_t *)"Stops EM - resets live and logged energy - starts EM"         ,   COMMAND_InvokeEnergyReset               },
		{(const uint8_t *)"rtc"             ,   (const uint8_t *)""                                         ,   (const uint8_t *)"Display current RTC time"                                     ,   COMMAND_InvokeRtc                       },
		{(const uint8_t *)"setrtc"          ,   (const uint8_t *)"dd/mm/yy hh:mm:ss ww"                     ,   (const uint8_t *)"Set RTC time"                                                 ,   COMMAND_InvokeSetRtc                    },
		{(const uint8_t *)"getenergylog"    ,   (const uint8_t *)""                                         ,   (const uint8_t *)"Prints last energy log"                                       ,   COMMAND_InvokeGetEnergyLog              },
		{(const uint8_t *)"backup"          ,   (const uint8_t *)"selection"                                ,   (const uint8_t *)"Backup to Storage Memory"                                     ,   COMMAND_InvokeBackup                    },
		{(const uint8_t *)"restore"         ,   (const uint8_t *)"selection"                                ,   (const uint8_t *)"Restore from Storage Memory"                                  ,   COMMAND_InvokeRestore                   },
		{(const uint8_t *)"readmem"         ,   (const uint8_t *)"type(0:EEP,1:DTFL) addr size [cast]"      ,   (const uint8_t *)"Read memory type at addr, size, display value"                ,   COMMAND_InvokeReadMemory                },
		{(const uint8_t *)"writemem"        ,   (const uint8_t *)"type(0:EEP,1:DTFL) addr size value"       ,   (const uint8_t *)"Write memory type at addr, size with value"                   ,   COMMAND_InvokeWriteMemory               },
		{(const uint8_t *)"readdtflhead"    ,   (const uint8_t *)""                                         ,   (const uint8_t *)"Read DataFlash status header"                                 ,   COMMAND_InvokeReadDTFLHeader            },
		{(const uint8_t *)"erasedtfl"       ,   (const uint8_t *)""                                         ,   (const uint8_t *)"Erase content of dataflash"                                   ,   COMMAND_InvokeEraseDTFL                 },
		{(const uint8_t *)"formatmem"       ,   (const uint8_t *)"type(0:EEP,1:DTFL)"                       ,   (const uint8_t *)"Format memory type (followed format.h)"                       ,   COMMAND_InvokeFormatMemory              },
		{(const uint8_t *)"dump"            ,   (const uint8_t *)"current"                                  ,   (const uint8_t *)"Dump waveform from EM Core"                                   ,   COMMAND_InvokeDumpSample          		},
		{(const uint8_t *)"calib"           ,   (const uint8_t *)"c cp imax v i w "                         ,   (const uint8_t *)"Calibrate (cycle,cycle_phase,imax,V,I,wire)"                  ,   COMMAND_InvokeCalibration               },
		{(const uint8_t *)"getcalib"        ,   (const uint8_t *)""                         				,   (const uint8_t *)"Prints Calibration Coefficients"                  			,   COMMAND_InvokeGetCalibration               },
		{(const uint8_t *)"setconfig"       ,   (const uint8_t *)"get:leave empty; set:1 later follow guide",   (const uint8_t *)"Manually set configuration"                                   ,   COMMAND_InvokeSetConfig                 },
		{(const uint8_t *)"cpuload"         ,   (const uint8_t *)""                                         ,   (const uint8_t *)"Measure the CPU Load"                                         ,   COMMAND_InvokeCPULoad                   },
		{(const uint8_t *)"vddcheck"        ,   (const uint8_t *)""                                         ,   (const uint8_t *)"Return VDD Range, According to LVD"                           ,   COMMAND_InvokeVddCheck                   },
		{(const uint8_t *)"invertpolarity"  ,   (const uint8_t *)"channel (1, 2, 3, 4)"                     ,   (const uint8_t *)"Inverts ADC readings (multiply by -1) on given channel"       ,   COMMAND_InvokeInvertPolarity                   },
};

static const uint8_t * g_mem_epr = (const uint8_t *)"EEPROM";
static const uint8_t * g_mem_dtfl = (const uint8_t *)"DATAFLASH";


