lwray-renesas/Metrology_NPL_3Ph4W/src/rl78i1c/application/debug/command.c
/******************************************************************************
 * Function Name : COMMAND_GetUnsigned16
 * Interface     : static uint16_t COMMAND_GetUnsigned16(uint8_t *buffer)
 * Description   : Get unsigned int 16 bit from buffer
 * Arguments     : uint8_t * buffer: Buffer to cast to uint16_t
 * Function Calls: None
 * Return Value  : static uint16_t
 ******************************************************************************/
static uint16_t COMMAND_GetUnsigned16(uint8_t *buffer)
{
	uint16_t u16;
	u16  = (uint16_t)buffer[0];
	u16 |= (uint16_t)buffer[1] << 8;

	return (u16);
}

/******************************************************************************
 * Function Name : COMMAND_GetUnsigned32
 * Interface     : static uint32_t COMMAND_GetUnsigned32(uint8_t *buffer)
 * Description   : Get unsigned long 32 bit from buffer
 * Arguments     : uint8_t * buffer: Buffer to cast to uint32_t
 * Function Calls: None
 * Return Value  : static uint32_t
 ******************************************************************************/
static uint32_t COMMAND_GetUnsigned32(uint8_t *buffer)
{
	uint32_t u32;
	u32  = (uint32_t)buffer[0];
	u32 |= (uint32_t)buffer[1] << 8;
	u32 |= (uint32_t)buffer[2] << 16;
	u32 |= (uint32_t)buffer[3] << 24;

	return (u32);
}

/***********************************************************************************************************************
 * Function Name : COMMAND_IsFloatNumber
 * Interface     : static uint8_t COMMAND_IsFloatNumber(uint8_t *buffer)
 * Description   : Check whether the input buffer is number or not
 * Arguments     : uint8_t * buffer: Buffer to check
 * Function Calls: None
 * Return Value  : static uin8t_t: 1 if buffer is number or 0 if buffer contain characters
 ***********************************************************************************************************************/
static uint8_t COMMAND_IsFloatNumber(uint8_t *buffer)
{
	/* Note this function not check the NULL buffer */
	uint8_t dot_count = 0;
	uint8_t plus_count = 0;
	uint8_t minus_count = 0;

	while(*buffer != 0)
	{
		if ((*buffer >= '0' && *buffer <='9') || (*buffer == '.')
				|| (*buffer == '+') || (*buffer == '-'))
		{
			/* Check number of '.' sign */
			if (*buffer == '.')
			{
				dot_count++;
				if (dot_count > 1)
				{
					return 0;
				}
			}

			/* Check number of '+' sign */
			if (*buffer == '+')
			{
				plus_count++;
				if (plus_count > 1)
				{
					return 0;
				}
			}

			/* Check number of '-' sign */
			if (*buffer == '-')
			{
				minus_count++;
				if (minus_count > 1)
				{
					return 0;
				}
			}
			buffer++;
		}
		else
		{
			return 0;
		}
	}

	return 1;
}

/******************************************************************************
 * Function Name    : static uint8_t *COMMAND_GetScanOneParam(
 *                  :     uint8_t *output,
 *                  :     uint16_t size,
 *                  :     uint8_t *input,
 *                  :     uint8_t *ahead_str,
 *                  :     uint8_t *break_str
 *                  : );
 * Description      : Command Get One Parameter
 * Arguments        : uint8_t *output: Output buffer
 *                  : uint16_t size: Size of output buffer
 *                  : uint8_t *input: Input buffer
 *                  : uint8_t *ahead_str: Char array to skip the ahead the arg_str
 *                  : uint8_t *break_str: Char array to break the scan processing
 * Functions Called : None
 * Return Value     : Next location of parameter
 ******************************************************************************/
static uint8_t *COMMAND_GetScanOneParam(uint8_t *output,
		uint16_t size,
		uint8_t *input,
		uint8_t *ahead_str,
		uint8_t *break_str)
{
	uint8_t i, j, break_len, ahead_len;

	/* Check parameter */
	if (output == NULL || size == 0 ||
			input  == NULL || break_str == NULL)
	{
		return NULL;
	}

	if (ahead_str != NULL && *ahead_str != 0)
	{
		ahead_len = (uint8_t)strlen((char *)ahead_str);

		/* skip all ahead char that found on arg_str */
		while (*input != 0)
		{
			for (j = 0; j < ahead_len; j++)
			{
				if (ahead_str[j] == *input)
					break;
			}

			/* is found in break_str? */
			if (j != ahead_len)
			{
				input++;
			}
			else    /* Not found */
			{
				break;  /* Break the outsize loop */
			}
		}
	}

	/* Is have remain char? */
	if (*input != 0)
	{
		/* clear output buffer */
		memset(output, 0, size);

		/* Get the lenght of break_str */
		break_len = (uint8_t)strlen((char *)break_str);

		/* Scan the parameter */
		i = 0;
		while (i < size && *input != 0)
		{
			for (j = 0; j < break_len; j++)
			{
				if (break_str[j] == *input)
					break;
			}

			/* is found in break_str?
			 * --> end of scanning */
			if (j != break_len)
			{
				break;  /* end of scanning */
			}
			else    /* Not found --> continue to scan */
			{
				/* Update to buffer */
				output[i] = *input;

				/* scan next byte */
				input++;
				i++;
			}
		}

		return input;
	}
	else
	{
		return NULL;
	}
}

/******************************************************************************
 * Function Name    : static uint16_t COMMAND_HexStringToUnsigned16(uint8_t *str)
 * Description      : Command Convert Hex String to number
 * Arguments        : uint8_t *str: Hex string
 * Functions Called : None
 * Return Value     : None
 ******************************************************************************/
static uint16_t COMMAND_HexStringToUnsigned16(uint8_t *str, uint8_t *b_found)
{
	uint16_t    rlt = 0;
	uint8_t     hexnum;

	*b_found = 0; /* Not found */

	/* Check parameter */
	if (str == NULL)
	{
		return 0;
	}

	/* point to 'x' char */
	while (*str != 0 && *str != 'x')
	{
		str++;
	}

	/* end string? */
	if (*str == 0 || (*(str+1)) == 0)
	{
		return 0;
	}

	str++;  /* skip 'x' */
	while ( *str != 0  &&       /* not end string?, and */
			((*str >= '0' &&
					*str <= '9') ||       /* is numberic char?, or */
					(*str >= 'a' &&
							*str <= 'f') ||       /* is in 'a-f'?, or */
							(*str >= 'A' &&
									*str <= 'F')) )       /* is in 'A-F'? */
	{
		*b_found = 1;   /* found */

