lwray-renesas/Metrology_NPL_3Ph4W/src/rl78i1c/application/debug/command.c
		if (*str >= 'a')
		{
			hexnum = 10 + (*str - 'a');     /* Get number */
		}
		else if (*str >= 'A')
		{
			hexnum = 10 + (*str - 'A');
		}
		else
		{
			hexnum = *str - '0';
		}

		rlt  = rlt << 4;
		rlt += hexnum;

		/* next char */
		str++;
	}

	return rlt;
}

/******************************************************************************
 * Function Name    : static uint16_t COMMAND_DecStringToNum16_Logic(uint8_t *str)
 * Description      : Command Logic part of converting decimal string to 16bit number
 * Arguments        : uint8_t *str: Hex string
 *                  : uint8_t *b_found: is found number?
 * Functions Called : None
 * Return Value     : None
 ******************************************************************************/
static uint16_t COMMAND_DecStringToNum16_Logic(uint8_t *str, uint8_t *b_found)
{
	uint16_t    rlt = 0;
	uint8_t     decnum;

	/* No pointer checking here, this serve as logic implementation only */
	while ( *str != 0  &&       /* not end string?, and */
			(*str >= '0' &&
					*str <= '9'))     /* is numberic char?*/
	{
		*b_found = 1;   /* found */

		decnum = *str - '0';

		rlt  = rlt * 10;
		rlt += decnum;

		/* next char */
		str++;
	}

	return rlt;
}

/******************************************************************************
 * Function Name    : static uint16_t COMMAND_DecStringToUnsigned16(uint8_t *str)
 * Description      : Command Convert Dec String to number
 * Arguments        : uint8_t *str: Hex string
 * Functions Called : None
 * Return Value     : None
 ******************************************************************************/
static uint16_t COMMAND_DecStringToUnsigned16(uint8_t *str, uint8_t *b_found)
{
	uint16_t    rlt;

	*b_found = 0; /* Not found */

	/* Check parameter */
	if (str == NULL)
	{
		return 0;
	}

	/* end string? */
	if (*str == 0)
	{
		return 0;
	}

	rlt = COMMAND_DecStringToNum16_Logic(str, b_found);

	return rlt;
}


/******************************************************************************
 * Function Name    : static uint16_t COMMAND_DecStringToSigned16(uint8_t *str)
 * Description      : Command Convert Dec String to number
 * Arguments        : uint8_t *str: Hex string
 * Functions Called : None
 * Return Value     : None
 ******************************************************************************/
static int16_t COMMAND_DecStringToSigned16(uint8_t *str, uint8_t *b_found)
{
	int16_t     rlt;
	uint16_t    rlt_u;
	int16_t     sign;

	*b_found = 0; /* Not found */

	/* Check parameter */
	if (str == NULL)
	{
		return 0;
	}

	/* end string? */
	if (*str == 0)
	{
		return 0;
	}

	sign = (*str == '-') ? -1 : 1;
	if (sign == -1)
	{
		str++;
	}

	rlt_u = COMMAND_DecStringToNum16_Logic(str, b_found);

	/* Is input number in range of signed 16bit number? */
	if (sign == -1)
	{
		if (rlt_u > ((uint16_t)INT_MAX + 1))
		{
			*b_found = 0;
		}
	}
	else
	{
		if (rlt_u > INT_MAX)
		{
			*b_found = 0;
		}
	}

	/* Number checking OK, get sign to result */
	rlt = ((int16_t)rlt_u * sign);

	return rlt;
}


/******************************************************************************
 * Function Name    : static uint16_t COMMAND_HexBufferToUnsigned16(uint8_t *str, uint16_t len, uint8_t *b_found)
 * Description      : Command Convert Hex Buffer to number
 * Arguments        : uint8_t *str: Hex string
 * Functions Called : None
 * Return Value     : None
 ******************************************************************************/
static uint16_t COMMAND_HexBufferToUnsigned16(uint8_t *buf, uint16_t len, uint8_t *b_found)
{
	uint16_t    pos = 0;
	uint16_t    rlt = 0;
	uint8_t     hexnum;

	*b_found = 0; /* Not found */

	/* Check parameter */
	if (buf == NULL || len == 0)
	{
		return 0;
	}

	/* point to 'x' char */
	while (pos < len && buf[pos] != 'x')
	{
		pos++;
	}

	/* end of buffer? */
	if (pos == len)
	{
		return 0;
	}

	pos++;  /* skip 'x' */
	while ( pos < len  &&       /* not end string?, and */
			((buf[pos] >= '0' &&
					buf[pos] <= '9') ||       /* is numberic char?, or */
					(buf[pos] >= 'a' &&
							buf[pos] <= 'f') ||       /* is in 'a-f'?, or */
							(buf[pos] >= 'A' &&
									buf[pos] <= 'F')) )       /* is in 'A-F'? */
	{
		*b_found = 1;   /* found */

		if (buf[pos] >= 'a')
		{
			hexnum = 10 + (buf[pos] - 'a');     /* Get number */
		}
		else if (buf[pos] >= 'A')
		{
			hexnum = 10 + (buf[pos] - 'A');
		}
		else
		{
			hexnum = buf[pos] - '0';
		}

		rlt  = rlt << 4;
		rlt += hexnum;

		/* next char */
		pos++;
	}

	return rlt;
}

/******************************************************************************
 * Function Name : COMMAND_GetPowerFactorSignName
 * Interface     : static const uint8_t* COMMAND_GetPowerFactorSignName(EM_PF_SIGN sign)
 * Description   : Get the PF sign name
 * Arguments     : EM_PF_SIGN sign: The sign of power factor
 * Function Calls: None
 * Return Value  : static const uint8_t*
 ******************************************************************************/
static const uint8_t* COMMAND_GetPowerFactorSignName(EM_PF_SIGN sign)
{
	switch (sign)
	{
	case PF_SIGN_LEAD_C:
		return (const uint8_t*)"PF_SIGN_LEAD_C";
	case PF_SIGN_UNITY:
		return (const uint8_t*)"PF_SIGN_UNITY";
	case PF_SIGN_LAG_L:
		return (const uint8_t*)"PF_SIGN_LAG_L";
	default:
		return (const uint8_t*)"";
	}
}

/******************************************************************************
 * Function Name : COMMAND_GetPowerFactorSignName
 * Interface     : static const uint8_t* COMMAND_GetPowerFactorSignName(EM_PF_SIGN sign)
 * Description   : Get the DSAD gain name
 * Arguments     : dsad_gain_t gain: The gain of DSAD channel
 * Function Calls: None
 * Return Value  : static const uint8_t*
 ******************************************************************************/
static const uint8_t* COMMAND_GetDsadGainName(dsad_gain_t gain)
{
	switch (gain)
	{
	case GAIN_X1:
		return (const uint8_t*)"GAIN_X1";
	case GAIN_X2:
		return (const uint8_t*)"GAIN_X2";
	case GAIN_X4:
		return (const uint8_t*)"GAIN_X4";
	case GAIN_X8:
		return (const uint8_t*)"GAIN_X8";
	case GAIN_X16:
		return (const uint8_t*)"GAIN_X16";
	case GAIN_X32:
		return (const uint8_t*)"GAIN_X32";
	default:
		return (const uint8_t*)"UNKNOWN";
	}
}

