lwray-renesas/Metrology_NPL_3Ph4W/src/rl78i1c/application/debug/command.c
/******************************************************************************
 * Function Name    : static uint16_t COMMAND_DecBufferToUnsigned16(uint8_t *str, uint16_t len, uint8_t *b_found)
 * Description      : Command Convert Dec Buffer to number
 * Arguments        : uint8_t *buf: Dec buffer
 * Functions Called : None
 * Return Value     : None
 ******************************************************************************/
static uint16_t COMMAND_DecBufferToUnsigned16(uint8_t *buf, uint16_t len, uint8_t *b_found)
{
	uint16_t    pos = 0;
	uint16_t    rlt = 0;
	uint8_t     decnum;

	*b_found = 0; /* Not found */

	/* Check parameter */
	if (buf == NULL)
	{
		return 0;
	}

	/* end string? */
	if (len == 0)
	{
		return 0;
	}

	while ( pos < len &&        /* not end string?, and */
			(buf[pos] >= '0' &&
					buf[pos] <= '9'))     /* is numberic char?*/
	{
		*b_found = 1;   /* found */

		decnum = buf[pos] - '0';

		rlt  = rlt * 10;
		rlt += decnum;

		/* next char */
		pos++;
	}

	return rlt;
}

/********************************************************************************************
 * Function Name    : static uint8_t COMMAND_FastInputScan(uint8_t *output, uint8_t * input)
 * Description      : Command Convert Fast input parameter
 *                  : Ex1: Input "0-3" ==> Output: {0,1,2,3}
 *                  : Ex2: Input "0-1,2,3-4" ==> Output: {0,1,2,3,4}
 * Arguments        : uint8_t *input: Input argument string
 *                  : uint8_t *output: Output decoded argument in byte array
 * Functions Called : None
 * Return Value     : None
 ********************************************************************************************/
#define DELIMITER_SIGN              (',')
#define UPTO_SIGN                   ('-')

static uint8_t COMMAND_FastInputScan(uint8_t *output, uint8_t * input, uint8_t len_limit)
{
	uint8_t i;

	uint8_t pos_deli_start = 0, pos_deli_stop = 0;
	uint8_t pos_upto;

	uint8_t range_start, range_stop;
	uint8_t decoded_num;

	uint8_t input_len;
	uint8_t is_found;
	uint8_t upto_cnt = 0;

	/* Check for NULL argument */
	if (output == NULL || input == NULL)
	{
		return 1;                           //NULL params
	}

	/* Check first character */
	if (*input == DELIMITER_SIGN || *input == UPTO_SIGN)
	{
		return 2;                           //Wrong format
	}

	/* Get length of input string */
	input_len = (uint8_t)strlen((const char *)input);

	/* Check last character */
	if (input[input_len] == DELIMITER_SIGN || input[input_len] == UPTO_SIGN)
	{
		return 2;                           //Wrong format
	}

	/* Clear the buffer */
	memset(output, 0, len_limit);

	while (pos_deli_stop < input_len)
	{
		/* Find next DELIMITER_SIGN */
		for (i=pos_deli_start; i < input_len; i++)
		{
			pos_deli_stop = i;
			if (input[i] == DELIMITER_SIGN)
			{
				break;              //Found the delimiter
			}

			if (i == (input_len - 1))
			{
				pos_deli_stop++;    /* In case reach the end, need to increase one more time*/
			}
		}

		/* Now, got the range of  input*/
		/* Find the UPTO_SIGN */
		for (i=pos_deli_start; i < pos_deli_stop; i++)
		{
			if (input[i] == UPTO_SIGN)
			{
				upto_cnt++;
				pos_upto = i;
			}
		}

		if (upto_cnt > 1)
		{
			return 2;                       //Wrong format, duplicate UPTO_SIGN
		}
		else
		{
			if (upto_cnt == 1)
			{
				//Have upto_sign ==> decode
				/* Range start */
				range_start = (uint8_t)COMMAND_DecBufferToUnsigned16(&input[pos_deli_start],
						pos_upto - pos_deli_start,
						&is_found);

				/* Range stop */
				range_stop = (uint8_t)COMMAND_DecBufferToUnsigned16(&input[pos_upto+1],
						pos_deli_stop - 1 - pos_upto,
						&is_found);
				if (is_found &&
						(range_start < len_limit) && (range_stop < len_limit))
				{
					while(range_start <= range_stop)
					{
						*output++ = range_start;
						range_start++;
					}
				}
				else
				{
					return 2;               //Wrong data
				}
			}
			else
			{
				//No upto_sign ==> decode normally
				decoded_num = (uint8_t)COMMAND_DecBufferToUnsigned16(&input[pos_deli_start],
						pos_deli_stop - pos_deli_start,
						&is_found);
				if(is_found &&
						(decoded_num < len_limit))
				{
					*output++ = decoded_num;
				}
				else
				{
					return 2;                   //Wrong data
				}
			}
		}
		upto_cnt = 0;                           /* Reset upto_cnt */
		pos_deli_start = pos_deli_stop + 1;     /* Jump to pos after delimiter */
	}

	return 0;
}


/******************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeUsage(uint8_t *arg_str)
 * Description      : Command Invoke Usage
 * Arguments        : uint8_t index: Command index
 *                  : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ******************************************************************************/
static uint8_t COMMAND_InvokeUsage(uint8_t *arg_str)
{
	uint8_t i;

	CMD_SendString((uint8_t *)"\n\r");
	CMD_SendString((uint8_t *)"----------------------------------------------------------------------------------------------------------\n\r");
	CMD_Printf((uint8_t *)" %- 15s %- 42s %s\n\r", "Command Name", "Parameter", "Description");
	CMD_SendString((uint8_t *)"----------------------------------------------------------------------------------------------------------\n\r");
	for (i = 0; i < COMMAND_TABLE_LENGTH; i++)
	{
		R_WDT_Restart();
		CMD_Printf( (uint8_t *)" %- 15s %- 42s %s\n\r",
				cmd_table[i].cmd_name,
				cmd_table[i].params,
				cmd_table[i].description);
	}

	return 0;
}

/******************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeStartEM(uint8_t *arg_str)
 * Description      : Command Invoke Start EM
 * Arguments        : uint8_t index: Command index
 *                  : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ******************************************************************************/
static uint8_t COMMAND_InvokeStartEM(uint8_t *arg_str)
{
	CMD_SendString((uint8_t *)"\n\rStarting EM...");
	if (EM_Start() == EM_OK)
	{
		CMD_SendString((uint8_t *)"OK\n\r");
	}
	else
	{
		CMD_SendString((uint8_t *)"FAILED\n\r");
	}

