lwray-renesas/Metrology_NPL_3Ph4W/src/rl78i1c/application/debug/command.c
	return 0;
}

/******************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeStopEM(uint8_t *arg_str)
 * Description      : Command Invoke Stop EM
 * Arguments        : uint8_t index: Command index
 *                  : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ******************************************************************************/
static uint8_t COMMAND_InvokeStopEM(uint8_t *arg_str)
{
	CMD_SendString((uint8_t *)"\n\rStopping EM...");
	if (EM_Stop() == EM_OK)
	{
		CMD_SendString((uint8_t *)"OK\n\r");
	}
	else
	{
		CMD_SendString((uint8_t *)"FAILED\n\r");
	}

	return 0;
}

/******************************************************************************
 * Function Name    : static void COMMAND_ResetByIllegalMemory(void)
 * Description      : Command Intentionally Reset by using illegal memory access
 * Arguments        : None
 * Functions Called : None
 * Return Value     : None
 ******************************************************************************/
static void COMMAND_ResetByIllegalMemory(void)
{
#ifdef __IAR__
	asm("MOV ES, #1H");
	asm("MOV ES:1800H, #00H");
#else
	FAR_PTR uint16_t * ptr;

	ptr = (FAR_PTR uint16_t *)0x00011800;

	/* Illegal address access */
	*ptr = 0xFFFF;
#endif /* __IAR__ */
}

/******************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeRestartEM(uint8_t *arg_str)
 * Description      : Command Invoke Restart EM
 * Arguments        : uint8_t index: Command index
 *                  : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ******************************************************************************/
static uint8_t COMMAND_InvokeRestartEM(uint8_t *arg_str)
{
	CMD_SendString((uint8_t *)"\n\r Prepare illegal memory access...reset immediately...");

	COMMAND_ResetByIllegalMemory();

	return 0;
}

/******************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeDisplay(uint8_t *arg_str)
 * Description      : Command Invoke Display
 * Arguments        : uint8_t index: Command index
 *                  : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ******************************************************************************/
static uint8_t COMMAND_InvokeDisplay(uint8_t *arg_str)
{
	uint32_t    timeout;
	float32_t   temps_degree = 25.0f;
	static const uint8_t line_break[]   = "+------------------------------------------------------------------------+\n\r";
	static const uint8_t param_format[] = "| %- 30s | %# 15.3f | %- 20s|\n\r";
	static const uint8_t param_format_s[] = "| %- 30s | %# 15s | %- 20s|\n\r";

	CMD_Printf((uint8_t *)"\n\rWaiting for signal stable...");
	CMD_Printf((uint8_t *)"\n\r");

	timeout = 30000;
	while (timeout > 0)
	{
		timeout--;
	}

	CMD_SendString((uint8_t *)line_break);
	CMD_Printf((uint8_t *)"| %- 30s | %- 15s | %- 20s|\n\r", "Parameter", "Total", "Unit");
	CMD_SendString((uint8_t *)line_break);

	CMD_SendString((uint8_t *)line_break);
	CMD_Printf((uint8_t *)"| Phase 1\n\r");
	CMD_SendString((uint8_t *)line_break);

	CMD_Printf(
			(uint8_t *)param_format,
			"Voltage RMS Phase 1",
			g_inst_read_params.vrms[LINE_PHASE_R],
			"Volt"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Current RMS Phase 1",
			g_inst_read_params.irms[LINE_PHASE_R],
			"Ampere"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Active Power Phase 1",
			g_inst_read_params.active_power[LINE_PHASE_R],
			"Watt"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Fundamental Power Phase 1",
			g_inst_read_params.fundamental_power[LINE_PHASE_R],
			"Watt"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Reactive Power Phase 1",
			g_inst_read_params.reactive_power[LINE_PHASE_R],
			"VAr"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Apparent Power Phase 1",
			g_inst_read_params.apparent_power[LINE_PHASE_R],
			"VA"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Power Factor Phase 1",
			g_inst_read_params.power_factor[LINE_PHASE_R],
			" "
	);

	CMD_Printf(
			(uint8_t *)param_format_s,
			"Power Factor Sign Phase 1",
			COMMAND_GetPowerFactorSignName(g_inst_read_params.power_factor_sign[LINE_PHASE_R]),
			" "
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Line Frequency Phase 1",
			g_inst_read_params.freq[LINE_PHASE_R],
			"Hz"
	);

	CMD_SendString((uint8_t *)line_break);
	CMD_Printf((uint8_t *)"| Phase 2\n\r");
	CMD_SendString((uint8_t *)line_break);
	CMD_Printf(
			(uint8_t *)param_format,
			"Voltage RMS Phase 2",
			g_inst_read_params.vrms[LINE_PHASE_Y],
			"Volt"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Current RMS Phase 2",
			g_inst_read_params.irms[LINE_PHASE_Y],
			"Ampere"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Active Power Phase 2",
			g_inst_read_params.active_power[LINE_PHASE_Y],
			"Watt"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Fundamental Power Phase 2",
			g_inst_read_params.fundamental_power[LINE_PHASE_Y],
			"Watt"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Reactive Power Phase 2",
			g_inst_read_params.reactive_power[LINE_PHASE_Y],
			"VAr"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Apparent Power Phase 2",
			g_inst_read_params.apparent_power[LINE_PHASE_Y],
			"VA"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Power Factor Phase 2",
			g_inst_read_params.power_factor[LINE_PHASE_Y],
			" "
	);

	CMD_Printf(
			(uint8_t *)param_format_s,
			"Power Factor Sign Phase 2",
			COMMAND_GetPowerFactorSignName(g_inst_read_params.power_factor_sign[LINE_PHASE_Y]),
			" "
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Line Frequency Phase 2",
			g_inst_read_params.freq[LINE_PHASE_Y],
			"Hz"
	);

	CMD_SendString((uint8_t *)line_break);
	CMD_Printf((uint8_t *)"| Phase 3\n\r");
	CMD_SendString((uint8_t *)line_break);

	CMD_Printf(
			(uint8_t *)param_format,
			"Voltage RMS Phase 3",
			g_inst_read_params.vrms[LINE_PHASE_B],
			"Volt"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Current RMS Phase 3",
			g_inst_read_params.irms[LINE_PHASE_B],
			"Ampere"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Active Power Phase 3",
			g_inst_read_params.active_power[LINE_PHASE_B],
			"Watt"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Fundamental Power Phase 3",
			g_inst_read_params.fundamental_power[LINE_PHASE_B],
			"Watt"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Reactive Power Phase 3",
			g_inst_read_params.reactive_power[LINE_PHASE_B],
			"VAr"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Apparent Power Phase 3",
			g_inst_read_params.apparent_power[LINE_PHASE_B],
			"VA"
	);
	CMD_Printf(
			(uint8_t *)param_format,
			"Power Factor Phase 3",
			g_inst_read_params.power_factor[LINE_PHASE_B],
			" "
	);

	CMD_Printf(
			(uint8_t *)param_format_s,
			"Power Factor Sign Phase 3",
			COMMAND_GetPowerFactorSignName(g_inst_read_params.power_factor_sign[LINE_PHASE_B]),
			" "
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Line Frequency Phase 3",
			g_inst_read_params.freq[LINE_PHASE_Y],
			"Hz"
	);

	CMD_SendString((uint8_t *)line_break);
	CMD_Printf((uint8_t *)"| Neutral\n\r");
	CMD_SendString((uint8_t *)line_break);

	CMD_Printf(
			(uint8_t *)param_format,
			"Current RMS Neutral",
			g_inst_read_params.irms[LINE_NEUTRAL],
			"Ampere"
	);

	CMD_SendString((uint8_t *)line_break);
	CMD_Printf((uint8_t *)"| Total\n\r");
	CMD_SendString((uint8_t *)line_break);

	CMD_Printf(
			(uint8_t *)param_format,
			"Current RMS Total",
			g_inst_read_params.irms[LINE_TOTAL],
			"Ampere"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Active Power Total",
			g_inst_read_params.active_power[LINE_TOTAL],
			"Watt"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Fundamental Power Total",
			g_inst_read_params.fundamental_power[LINE_TOTAL],
			"Watt"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Reactive Power Total",
			g_inst_read_params.reactive_power[LINE_TOTAL],
			"VAr"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Apparent Power Total",
			g_inst_read_params.apparent_power[LINE_TOTAL],
			"VA"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Power Factor Phase Total",
			g_inst_read_params.power_factor[LINE_TOTAL],
			" "
	);

	CMD_Printf(
			(uint8_t *)param_format_s,
			"Power Factor Sign Total",
			COMMAND_GetPowerFactorSignName(g_inst_read_params.power_factor_sign[LINE_TOTAL]),
			" "
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Active Energy Total",
			g_inst_read_params.active_energy_total_import,
			"kWh"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Reactive Energy Lag (L) Total",
			g_inst_read_params.reactive_energy_lag_total_import,
			"kVArh"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Reactive Energy Lead (C) Total",
			g_inst_read_params.reactive_energy_lead_total_import,
			"kVArh"
	);

	CMD_Printf(
			(uint8_t *)param_format,
			"Apparent Energy Total",
			g_inst_read_params.apparent_energy_total_import,
			"kVAh"
	);

	CMD_SendString((uint8_t *)line_break);

