lwray-renesas/Metrology_NPL_3Ph4W/src/rl78i1c/application/debug/command.c
	return 0;
}

/******************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeDisplayBin(uint8_t *arg_str)
 * Description      : Command Invoke Display (Raw Binary) - outputs the inst read struct in raw binary format.
 * Arguments        : uint8_t index: Command index
 *                  : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ******************************************************************************/
static uint8_t COMMAND_InvokeDisplayBin(uint8_t *arg_str)
{
	static const uint16_t num_bytes = sizeof(EM_INST_READ_PARAMS);
	CMD_SendBuffer((uint8_t*)&num_bytes, 2); /* Send number of bytes first*/
	CMD_SendBuffer((uint8_t*)&g_inst_read_params, num_bytes);
	CMD_Printf((uint8_t *)"\n\r\n\r");

	return 0;
}

/******************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeEnergyReset(uint8_t *arg_str)
 * Description      : Resets the energy log and live energy value, stops and starts EM to do so.
 * Arguments        : uint8_t index: Command index
 *                  : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ******************************************************************************/
static uint8_t COMMAND_InvokeEnergyReset(uint8_t *arg_str)
{
	CMD_Printf((uint8_t*) "\n\rStopping EM...");
	if(EM_Stop() == EM_OK)
	{
		CMD_Printf((uint8_t*) "Success!\n\r");
		CMD_Printf((uint8_t*) "Formatting Energy Log...");
		if(STORAGE_EM_Format() == EM_STORAGE_OK)
		{
			CMD_Printf((uint8_t*) "Success!\n\r");
			CMD_Printf((uint8_t*) "Resetting Energy Counters...");
			if(STORAGE_EM_Restore() == EM_STORAGE_OK)
			{
				CMD_Printf((uint8_t*) "Success!\n\r");
				CMD_Printf((uint8_t*) "Starting EM...");
				if(EM_Start() == EM_OK)
				{
					CMD_Printf((uint8_t*) "Success!\n\r");
				}
				else
				{
					CMD_Printf((uint8_t*) "Failed!\n\r");
				}
			}
			else
			{
				CMD_Printf((uint8_t*) "Failed!\n\r");
			}
		}
		else
		{
			CMD_Printf((uint8_t*) "Failed!\n\r");
		}
	}
	else
	{
		CMD_Printf((uint8_t*) "Failed!\n\r");
	}
	return 0;
}

/***********************************************************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeRtc(uint8_t *arg_str)
 * Description      : Command Invoke RTC
 * Arguments        : uint8_t index: Command index
 *                  : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ***********************************************************************************************************************/
static uint8_t COMMAND_InvokeRtc(uint8_t *arg_str)
{
	rtc_counter_value_t rtctime;

	R_RTC_Get_CalendarCounterValue(&rtctime);

	CMD_Printf((uint8_t *)"\n\rRTC Time: %02x/%02x/20%x %02x:%02x:%02x Week: %02x\n\r",
			rtctime.day,
			rtctime.month,
			rtctime.year,
			rtctime.hour,
			rtctime.min,
			rtctime.sec,
			rtctime.week);

	return 0;
}

/***********************************************************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeSetRtc(uint8_t *arg_str)
 * Description      : Command Invoke Set RTC
 * Arguments        : uint8_t index: Command index
 *                  : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ***********************************************************************************************************************/
static uint8_t COMMAND_InvokeSetRtc(uint8_t *arg_str)
{   
	//uint16_t timeout;
	uint8_t status;
	rtc_counter_value_t rtctime;
	uint8_t buffer[20];

	CMD_SendString((uint8_t *)"\n\rParameter(s): ");
	CMD_SendString((uint8_t *)arg_str);
	CMD_SendString((uint8_t *)"\n\r");

	/* Get Day parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" /");

	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* get number */
		rtctime.day = (uint8_t)atoi((char * __near)buffer);
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	/* Get Month parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" /", (uint8_t *)" /");

	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* get number */
		rtctime.month = (uint8_t)atoi((char * __near)buffer);
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	/* Get Year parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" /", (uint8_t *)" ");

	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* get number */
		rtctime.year = (uint8_t)atoi((char * __near)buffer);
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	/* Get Hour parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" :");

	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* get number */
		rtctime.hour = (uint8_t)atoi((char * __near)buffer);
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	/* Get Min parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" :", (uint8_t *)" :");

	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* get number */
		rtctime.min = (uint8_t)atoi((char * __near)buffer);
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	/* Get Sec parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" :", (uint8_t *)" ");

	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* get number */
		rtctime.sec = (uint8_t)atoi((char * __near)buffer);
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

