lwray-renesas/Metrology_NPL_3Ph4W/src/rl78i1c/application/debug/command.c
	/* Get Week parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" ");

	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* get number */
		rtctime.week = (uint8_t)atoi((char * __near)buffer);
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	_DEC2BCD(rtctime.day);
	_DEC2BCD(rtctime.month);
	_DEC2BCD(rtctime.year);
	_DEC2BCD(rtctime.hour);
	_DEC2BCD(rtctime.min);
	_DEC2BCD(rtctime.sec);

	CMD_SendString((uint8_t *)"Set RTC time...");

	R_RTC_Set_CalendarCounterValue(rtctime);
	status = MD_OK;

	if (status == MD_OK)
	{
		CMD_SendString((uint8_t *)"OK\n\r");
	}
	else
	{
		CMD_SendString((uint8_t *)"FAILED\n\r");
	}

	return 0;
}

/***********************************************************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeGetEnergyLog(uint8_t *arg_str)
 * Description      : Command Invoke get energy log
 * Arguments        : uint8_t index: Command index
 *                  : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ***********************************************************************************************************************/
static uint8_t COMMAND_InvokeGetEnergyLog(uint8_t *arg_str)
{
	EM_EEPROM_ENERGY_LOG l_debug_energy_log;
	EM_ENERGY_VALUE em_energy_value;

	(void)STORAGE_EM_GetEnergyData(&l_debug_energy_log);
	EM_EnergyDataToEnergyValue(&(l_debug_energy_log.energy_data), &em_energy_value);

	CMD_Printf((uint8_t *)"\n\rRTC Time: %02x/%02x/20%x %02x:%02x:%02x Week: %02x\n\r",
			l_debug_energy_log.time_stamp.day,
			l_debug_energy_log.time_stamp.month,
			l_debug_energy_log.time_stamp.year,
			l_debug_energy_log.time_stamp.hour,
			l_debug_energy_log.time_stamp.min,
			l_debug_energy_log.time_stamp.sec,
			l_debug_energy_log.time_stamp.week);

	CMD_Printf((uint8_t *)"Total Active Energy (Import): %.03f [kWh]\n\r",
			(em_energy_value.integer.active_imp        + em_energy_value.decimal.active_imp));
	CMD_Printf((uint8_t *)"Total Active Energy (Export): %.03f [kWh]\n\r",
			(em_energy_value.integer.active_exp        + em_energy_value.decimal.active_exp));
	CMD_Printf((uint8_t *)"Total Reactive Energy Lag (L - Import): %.03f [kVArh]\n\r",
			(em_energy_value.integer.reactive_ind_imp  + em_energy_value.decimal.reactive_ind_imp));
	CMD_Printf((uint8_t *)"Total Reactive Energy Lag (L - Export): %.03f [kVArh]\n\r",
			(em_energy_value.integer.reactive_ind_exp  + em_energy_value.decimal.reactive_ind_exp));
	CMD_Printf((uint8_t *)"Total Reactive Energy Lead (C - Import): %.03f [kVArh]\n\r",
			(em_energy_value.integer.reactive_cap_imp  + em_energy_value.decimal.reactive_cap_imp));
	CMD_Printf((uint8_t *)"Total Reactive Energy Lead (C - Export): %.03f [kVArh]\n\r",
			(em_energy_value.integer.reactive_cap_exp  + em_energy_value.decimal.reactive_cap_exp));
	CMD_Printf((uint8_t *)"Total Apparent Energy (Import): %.03f [kVAh]\n\r",
			(em_energy_value.integer.apparent_imp      + em_energy_value.decimal.apparent_imp));
	CMD_Printf((uint8_t *)"Total Apparent Energy (Export): %.03f [kVAh]\n\r",
			(em_energy_value.integer.apparent_exp      + em_energy_value.decimal.apparent_exp));

	return 0;
}

/***********************************************************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeBackup(uint8_t *arg_str)
 * Description      : Command Invoke Backup
 * Arguments        : uint8_t index: Command index
 *                  : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ***********************************************************************************************************************/
static uint8_t COMMAND_InvokeBackup(uint8_t *arg_str)
{
	uint8_t selection;
	uint8_t buffer[20];
	uint8_t b_found;

	CMD_SendString((uint8_t *)"\n\rParameter(s): ");
	CMD_SendString((uint8_t *)arg_str);
	CMD_SendString((uint8_t *)"\n\r");

	/* Get Selection parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" ");

	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* Get hex first */
		selection = (uint8_t)COMMAND_HexStringToUnsigned16(buffer, &b_found);

		/* next for get number */
		if (b_found == 0)
		{
			selection = (uint8_t)atoi((char * __near)buffer);
		}

		if (selection == CONFIG_ITEM_NONE)
		{
			CMD_SendString((uint8_t *)"Parameter error\n\r");
			return 1;
		}

		/* Backup Item */
		CMD_SendString((uint8_t *)"Backup Item: ");
		if (selection & CONFIG_ITEM_CALIB)
		{
			CMD_SendString((uint8_t *)"Calibration ");
		}

		CMD_SendString((uint8_t *)"...");

		if (CONFIG_Backup(selection) != CONFIG_OK)
		{
			CMD_SendString((uint8_t *)"FAILED\n\r");
		}
		else
		{
			CMD_SendString((uint8_t *)"OK\n\r");
		}

		if (STORAGE_EM_Backup() != EM_STORAGE_OK)
		{
			CMD_SendString((uint8_t *)"FAILED\n\r");
		}
		else
		{
			CMD_SendString((uint8_t *)"OK\n\r");
		}
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	return 0;
}

/***********************************************************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeRestore(uint8_t *arg_str)
 * Description      : Command Invoke Restore
 * Arguments        : uint8_t index: Command index
 *                  : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ***********************************************************************************************************************/
static uint8_t COMMAND_InvokeRestore(uint8_t *arg_str)
{
	uint8_t selection;
	uint8_t buffer[20];
	uint8_t b_found;

	CMD_SendString((uint8_t *)"\n\rParameter(s): ");
	CMD_SendString((uint8_t *)arg_str);
	CMD_SendString((uint8_t *)"\n\r");

	/* Get Selection parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" ");

