lwray-renesas/Metrology_NPL_3Ph4W/src/rl78i1c/application/debug/command.c
	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* Get hex first */
		selection = (uint8_t)COMMAND_HexStringToUnsigned16(buffer, &b_found);

		/* next for get number */
		if (b_found == 0)
		{
			selection = (uint8_t)atoi((char * __near)buffer);
		}

		if (selection == CONFIG_ITEM_NONE)
		{
			CMD_SendString((uint8_t *)"Parameter error\n\r");
			return 1;
		}

		/* Backup Item */
		CMD_SendString((uint8_t *)"Backup Item: ");
		if (selection & CONFIG_ITEM_CALIB)
		{
			CMD_SendString((uint8_t *)"Calibration ");
		}

		CMD_SendString((uint8_t *)"...");

		EM_Stop();

		if (CONFIG_Restore(selection) != CONFIG_OK)
		{
			CMD_SendString((uint8_t *)"FAILED\n\r");
		}
		else
		{
			CMD_SendString((uint8_t *)"OK\n\r");
		}

		if (STORAGE_EM_Restore() != EM_STORAGE_OK)
		{
			CMD_SendString((uint8_t *)"FAILED\n\r");
		}
		else
		{
			CMD_SendString((uint8_t *)"OK\n\r");
		}

		EM_Start();
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	return 0;
}

/***********************************************************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeReadMemory(uint8_t *arg_str)
 * Description      : Command Invoke Read Memory
 * Arguments        : uint8_t index: Command index
 *                  : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ***********************************************************************************************************************/
static uint8_t COMMAND_InvokeReadMemory(uint8_t *arg_str)
{
	static const uint16_t type_cast_size[7] =
	{
			1,  /* uint8_t */
			1,  /* int8_t */
			2,  /* uint16_t */
			2,  /* int16_t */
			4,  /* uint32_t */
			4,  /* int32_t */
			4,  /* float32_t */
	};

	uint32_t    addr;
	uint16_t    size, i, pagesize, count;
	uint8_t     b_found = 0;
	uint8_t     buffer[32];
	int8_t      cast_id = -1;
	uint16_t    u16;
	uint32_t    u32;
	float32_t   f32;
	uint8_t     is_dtfl;
	uint8_t const * p_mem_name;

	uint8_t (*FUNC_MemRead)(uint32_t addr, uint8_t *buf, uint16_t size);

	CMD_SendString((uint8_t *)"\n\rParameter(s): ");
	CMD_SendString((uint8_t *)arg_str);
	CMD_SendString((uint8_t *)"\n\r");

	/* Get memory type parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" /");

	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		is_dtfl = buffer[0] - '0';

		if (is_dtfl)
		{
			FUNC_MemRead = DATAFLASH_Read;
			p_mem_name = g_mem_dtfl;
		}
		else
		{
			FUNC_MemRead = EPR_Read;
			p_mem_name = g_mem_epr;
		}
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	/* Get Addr parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" ");

	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* Get hex first */
		addr = COMMAND_HexStringToUnsigned16(buffer, &b_found);

		/* next for get number */
		if (b_found == 0)
		{
			addr = COMMAND_DecStringToUnsigned16(buffer, &b_found);
		}
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	/* Get Size parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" ");

	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* Get hex first */
		size = COMMAND_HexStringToUnsigned16(buffer, &b_found);

		/* next for get number */
		if (b_found == 0)
		{
			size = atoi((char * __near)buffer);
		}
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	/* Get Cast parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" ");
	if (arg_str != NULL)
	{
		/* found argument */
		if (strcmp("uint8_t", (const char*)buffer) == 0)
		{
			cast_id = 0;    /* uint8_t */
		}
		else if (strcmp("int8_t", (const char*)buffer) == 0)
		{
			cast_id = 1;    /* int8_t */
		}
		else if (strcmp("uint16_t", (const char*)buffer) == 0)
		{
			cast_id = 2;    /* uint16_t */
		}
		else if (strcmp("int16_t", (const char*)buffer) == 0)
		{
			cast_id = 3;    /* int16_t */
		}
		else if (strcmp("uint32_t", (const char*)buffer) == 0)
		{
			cast_id = 4;    /* uint32_t */
		}
		else if (strcmp("int32_t", (const char*)buffer) == 0)
		{
			cast_id = 5;    /* int32_t */
		}
		else if (strcmp("float32_t", (const char*)buffer) == 0)
		{
			cast_id = 6;    /* float32_t */
		}
		else
		{
			CMD_SendString((uint8_t *)"Parameter error\n\r");
			return 1;
		}
	}

	if (cast_id != -1)
	{
		CMD_Printf((uint8_t *)"\n\r--- %s Data (cast by %s) ---\n\r",p_mem_name, buffer);
	}
	else
	{
		CMD_Printf((uint8_t *)"\n\r--- %s Data (HEX, Max 1line = 32 bytes) ---\n\r", p_mem_name);
	}

	count = 0;
	while (size > 0)
	{
		if (size >= 32)
		{
			pagesize = 32;
		}
		else
		{
			pagesize = size;
		}

		if (FUNC_MemRead(addr, buffer, pagesize) == EPR_OK)
		{
			if (cast_id != -1)
			{
				for (i = 0; i < pagesize; i += type_cast_size[cast_id])
				{
					switch (cast_id)
					{
					case 0:/* uint8_t */
						CMD_Printf((uint8_t *)"%05i - 0x%08lx: (0x%02x) %i\n\r", count, addr+i, (uint8_t)buffer[i], (uint8_t)buffer[i]);
						break;

					case 1:/* int8_t */
						CMD_Printf((uint8_t *)"%05i - 0x%08lx: (0x%02x) %i\n\r", count, addr+i, (uint8_t)buffer[i], (int8_t)buffer[i]);
						break;

					case 2:/* uint16_t */
						u16 = COMMAND_GetUnsigned16(&buffer[i]);
						CMD_Printf((uint8_t *)"%05i - 0x%08lx: (0x%04x) %d\n\r", count, addr+i, u16, u16);
						break;

					case 3:/* int16_t */
						u16 = COMMAND_GetUnsigned16(&buffer[i]);
						CMD_Printf((uint8_t *)"%05i - 0x%08lx: (0x%04x) %d\n\r", count, addr+i, u16, (int16_t)u16);
						break;

					case 4:/* uint32_t */
						u32 = COMMAND_GetUnsigned32(&buffer[i]);
						CMD_Printf((uint8_t *)"%05i - 0x%08lx: (0x%08lx) %ld\n\r", count, addr+i, u32, u32);
						break;

					case 5:/* int32_t */
						u32 = COMMAND_GetUnsigned32(&buffer[i]);
						CMD_Printf((uint8_t *)"%05i - 0x%08lx: (0x%08lx) %ld\n\r", count, addr+i, u32, (int32_t)u32);
						break;

