lwray-renesas/Metrology_NPL_3Ph4W/src/rl78i1c/application/debug/command.c
					case 6:/* float32_t */
						u32 = COMMAND_GetUnsigned32(&buffer[i]);
						f32 = *((float32_t *)&u32);
						CMD_Printf((uint8_t *)"%05i - 0x%08lx: (0x%08lx) %.06f\n\r", count, addr+i, u32, f32);
						break;

					default:
						CMD_SendString((uint8_t *)"Internal error.\n\r");
						return 2;
					}

					count++;
				}
			}
			else
			{
				for (i = 0; i < pagesize; i++)
				{
					CMD_Printf((uint8_t *)"%02x ", buffer[i]);
				}
				CMD_SendString((uint8_t *)"\n\r");
			}

			/* New page */
			addr += pagesize;
			size -= pagesize;

			/* Break if CTRL+C is pressed */
			if (CMD_IsCtrlKeyReceived())
			{
				CMD_Printf((uint8_t *)"\n\rCTRL + C is pressed! Break!\n\r");
				CMD_AckCtrlKeyReceived();

				/* Break printout here */
				break;
			}

			R_WDT_Restart();
		}
		else
		{
			CMD_Printf((uint8_t *)"\n\rRead %s failed at page [addr:0x%04x, size:0x%04x]!\n\r", p_mem_name, addr, pagesize);
			break;
		}
	}

	CMD_Printf((uint8_t *)"--- %s Data -----------------\n\r", p_mem_name);

	return 0;
}

/***********************************************************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeWriteMemory(uint8_t *arg_str)
 * Description      : Command Invoke Write Memory
 * Arguments        : uint8_t index: Command index
 *                  : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ***********************************************************************************************************************/
static uint8_t COMMAND_InvokeWriteMemory(uint8_t *arg_str)
{
	uint32_t    addr;
	uint16_t    size, value, pagesize;
	uint8_t     b_found = 0;
	uint8_t     b_string = 0;
	uint8_t *   p_str_old;
	uint8_t     buffer[32];
	uint8_t     is_dtfl;
	uint8_t const * p_mem_name;

	uint8_t (*FUNC_MemWrite)(uint32_t addr, uint8_t *buf, uint16_t size);

	CMD_SendString((uint8_t *)"\n\rParameter(s): ");
	CMD_SendString((uint8_t *)arg_str);
	CMD_SendString((uint8_t *)"\n\r");

	/* Get memory type parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" /");

	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		is_dtfl = buffer[0] - '0';

		if (is_dtfl)
		{
			FUNC_MemWrite = DATAFLASH_Write;
			p_mem_name = g_mem_dtfl;
		}
		else
		{
			FUNC_MemWrite = EPR_Write;
			p_mem_name = g_mem_epr;
		}
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	/* Get Addr parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" ");

	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* Get hex first */
		addr = COMMAND_HexStringToUnsigned16(buffer, &b_found);

		/* next for get number */
		if (b_found == 0)
		{
			addr = COMMAND_DecStringToUnsigned16(buffer, &b_found);
		}
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	/* Get Size parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" ");

	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* Get hex first */
		size = COMMAND_HexStringToUnsigned16(buffer, &b_found);

		/* next for get number */
		if (b_found == 0)
		{
			size = atoi((char * __near)buffer);
		}
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	/* Get string parameter */
	p_str_old = arg_str;
	arg_str   = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" (", (uint8_t *)")");

	/* is NOT have string parameter? */
	if (arg_str == NULL || *arg_str != ')')
	{
		/* scan number */
		arg_str = COMMAND_GetScanOneParam(buffer, 20, p_str_old, (uint8_t *)" ", (uint8_t *)" ");

		if (arg_str != NULL &&
				(buffer[0] >= '0' && buffer[0] <= '9'))
		{
			/* Get hex first */
			value = COMMAND_HexStringToUnsigned16(buffer, &b_found);

			/* next for get number */
			if (b_found == 0)
			{
				value = atoi((char * __near)buffer);
			}
		}
		else
		{
			CMD_SendString((uint8_t *)"Parameter error\n\r");
			return 1;
		}
	}
	else
	{
		b_string = 1;
	}

	if (arg_str == NULL)
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	CMD_Printf((uint8_t *)"Start write to %s...", p_mem_name);

	while (size > 0)
	{
		if (size >= 32)
		{
			pagesize = 32;
		}
		else
		{
			pagesize = size;
		}

		if (b_string != 1)
		{
			memset(buffer, value, pagesize);
		}

		/* write buffer */
		if (FUNC_MemWrite(addr, buffer, pagesize) == EPR_OK)
		{
			/* New page */
			addr += pagesize;
			size -= pagesize;
		}
		else
		{
			CMD_Printf((uint8_t *)"\n\rWrite %s failed at page [addr:0x%04x, size:%i]!\n\r", p_mem_name, addr, pagesize);
			return 1;
		}

		R_WDT_Restart();
	}

	CMD_SendString((uint8_t *)"OK\n\r");

	return 0;
}

/***********************************************************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeReadDTFLHeader(uint8_t *arg_str)
 * Description      : Command Invoke Read the DataFlash header byte
 * Arguments        : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ***********************************************************************************************************************/
static uint8_t COMMAND_InvokeReadDTFLHeader(uint8_t *arg_str)
{
	uint8_t status0, status1;
	uint16_t crc0, crc1;
	CMD_SendString((uint8_t *)"\n\r");
	CMD_SendString((uint8_t *)"DataFlash Bank 0 Header Status Read...");
	if (DATAFLASH_ReadHeaderStatus(0, &status0))
	{
		CMD_SendString((uint8_t *)"FAILED\n\r");
		return 1;
	}
	else
	{
		CMD_SendString((uint8_t *)"OK\n\r");
	}

	CMD_SendString((uint8_t *)"DataFlash Bank 0 Header CRC Read...");
	if (DATAFLASH_ReadHeaderCRC(0, (uint8_t *)&crc0))
	{
		CMD_SendString((uint8_t *)"FAILED\n\r");
		return 1;
	}
	else
	{
		CMD_SendString((uint8_t *)"OK\n\r");
	}

	CMD_SendString((uint8_t *)"DataFlash Bank 1 Header Status Read...");
	if (DATAFLASH_ReadHeaderStatus(1, &status1))
	{
		CMD_SendString((uint8_t *)"FAILED\n\r");
		return 1;
	}
	else
	{
		CMD_SendString((uint8_t *)"OK\n\r");
	}

	CMD_SendString((uint8_t *)"DataFlash Bank 1 Header CRC Read...");
	if (DATAFLASH_ReadHeaderCRC(1, (uint8_t *)&crc1))
	{
		CMD_SendString((uint8_t *)"FAILED\n\r");
		return 1;
	}
	else
	{
		CMD_SendString((uint8_t *)"OK\n\r");
	}



	/* Reading OK, print result */
	CMD_Printf((uint8_t *)"\n\r Bank 0, status: %s, CRC: 0x%x", (status0 == 1) ? "valid" : "invalid", crc0);
	CMD_Printf((uint8_t *)"\n\r Bank 1, status: %s, CRC: 0x%x", (status1 == 1) ? "valid" : "invalid", crc1);

