lwray-renesas/Metrology_NPL_3Ph4W/src/rl78i1c/application/debug/command.c
	return 0;
}

/***********************************************************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeEraseDTFL(uint8_t *arg_str)
 * Description      : Command Invoke Erase DataFlash content
 * Arguments        : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ***********************************************************************************************************************/
static uint8_t COMMAND_InvokeEraseDTFL(uint8_t *arg_str)
{
	CMD_SendString((uint8_t *)"\n\r");

	CMD_SendString((uint8_t *)"DataFlash Bank0 Clear...");
	if (DATAFLASH_BankErase(0) != DATAFLASH_OK)
	{
		CMD_SendString((uint8_t *)"FAILED\n\r");
		return 1;
	}
	else
	{
		/* OK */
		CMD_SendString((uint8_t *)"OK\n\r");
	}

	CMD_SendString((uint8_t *)"DataFlash Bank1 Clear...");
	if (DATAFLASH_BankErase(1) != DATAFLASH_OK)
	{
		CMD_SendString((uint8_t *)"FAILED\n\r");
		return 1;
	}
	else
	{
		/* OK */
		CMD_SendString((uint8_t *)"OK\n\r");
	}

	/* Restart the meter right after erase
	 * Purpose: the calibration information is cleared, will cause math error exception in CA
	 */
	CMD_SendString((uint8_t *)"Restart meter now...");
	COMMAND_ResetByIllegalMemory();

	return 0;
}

/***********************************************************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeFormatMemory(uint8_t *arg_str)
 * Description      : Command Invoke Format Memory
 * Arguments        : uint8_t index: Command index
 *                  : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ***********************************************************************************************************************/
static uint8_t COMMAND_InvokeFormatMemory(uint8_t *arg_str)
{
	uint8_t buffer[20];
	uint8_t is_dtfl;

	CMD_SendString((uint8_t *)"\n\rParameter(s): ");
	CMD_SendString((uint8_t *)arg_str);
	CMD_SendString((uint8_t *)"\n\r");

	/* Get memory type parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" /");

	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		is_dtfl = buffer[0] - '0';

	}

	if (is_dtfl)
	{
		CMD_SendString((uint8_t *)"\n\rFormatting Configuration Page...");

		R_WDT_Restart();

		if (CONFIG_Format() == CONFIG_OK)
		{
			CMD_SendString((uint8_t *)"OK\n\r");
		}
		else
		{
			CMD_SendString((uint8_t *)"FAILED\n\r");
		}

	}
	else
	{
		CMD_SendString((uint8_t *)"\n\rFormatting MeterData...");

		R_WDT_Restart();

		if (STORAGE_EM_Format() == EM_STORAGE_OK)
		{
			CMD_SendString((uint8_t *)"OK\n\r");
		}
		else
		{
			CMD_SendString((uint8_t *)"FAILED\n\r");
		}

	}
	return 0;
}

/******************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeDumpSample(uint8_t *arg_str)
 * Description      : Command Invoke Dump ADC samples
 * Arguments        : uint8_t index: Command index
 *                  : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ******************************************************************************/
static uint8_t COMMAND_InvokeDumpSample(uint8_t *arg_str)
{
	uint16_t i;
	uint8_t buffer[20];

	CMD_Printf(
			(uint8_t *)"\n\rWaiting for waveform to stabilise...\n\r"
	);

	/* Send request to EM Core to dump the waveform */
	g_wrp_sample_count = 0U;
	while(g_wrp_sample_count < EM_ADC_MAX_DEBUG_SAMPLE)
	{
		NOP();
	}

	/* Print out */
	CMD_Printf(
			(uint8_t *)"\n\rWaveform of voltage & current samples\n\r"
	);

	CMD_Printf(
			(uint8_t *)"V1, V1-90, V2, V2-90, V3, V3-90, I1, I2, I3, IN\n\r"
	);

	for (i = 0; i < g_wrp_sample_count; i++)
	{
		CMD_Printf((uint8_t *)"%d, %d, %d, %d, %d, %d, %ld, %ld, %ld, %ld\n\r",
				g_wrp_sample_int16[0][i], g_wrp_sample_int16[3][i],
				g_wrp_sample_int16[1][i], g_wrp_sample_int16[4][i],
				g_wrp_sample_int16[2][i], g_wrp_sample_int16[5][i],
				g_wrp_sample_int32[0][i], g_wrp_sample_int32[1][i],
				g_wrp_sample_int32[2][i], g_wrp_sample_int32[3][i]);
	}

	return 0;
}

/******************************************************************************
 * Function Name   : COMMAND_InvokeCalibration
 * Interface       : static void COMMAND_InvokeCalibration(uint8_t *arg_str)
 * Description     : Command Invoke Calibration
 * Arguments       : uint8_t * arg_str: Arguments string
 * Function Calls  : None
 * Return Value    : None
 ******************************************************************************/
static uint8_t COMMAND_InvokeCalibration(uint8_t *arg_str)
{
	/* Command parameters */
	float32_t   calib_imax, calib_v, calib_i;                     /* Voltage and Current for calibrating */
	uint16_t    calib_c, calib_cp;                          /* Number of line cycle for calibrating & phase error loop */
	uint8_t     w;                              /* Choose calibrated channel */
	uint8_t buffer[20];                         /* Data buffer to store input arguments */

	CMD_SendString((uint8_t *)"\n\rParameter(s): ");
	CMD_SendString((uint8_t *)arg_str);
	CMD_SendString((uint8_t *)"\n\r");

	/* Get c parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" ");
	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* get number */
		calib_c = (uint16_t)atol((char * __near)buffer);
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	/* Get cp parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" ");
	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* get number */
		calib_cp = (uint16_t)atol((char * __near)buffer);
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	/* Get imax parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" ");
	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* get number */
		calib_imax = atof((char * __near)buffer);
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	/* Get v parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" ");
	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* get number */
		calib_v = atof((char * __near)buffer);
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

