lwray-renesas/Metrology_NPL_3Ph4W/src/rl78i1c/application/debug/command.c
	/* Get i parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" ");
	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* get number */
		calib_i = atof((char * __near)buffer);
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	/* Get w parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" ");
	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* get number */
		w = (uint8_t)atoi((char * __near)buffer);
		if (w > 1)
		{
			CMD_SendString((uint8_t *)"Parameter error\n\r");
			return 1;
		}
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	CALIBRATION_Invoke(calib_c, calib_cp, calib_imax, calib_v, calib_i, w);

	return 0;
}

static uint8_t COMMAND_InvokeGetCalibration(uint8_t *arg_str)
{
	EM_CALIBRATION calib;
	(void)arg_str;

	calib = EM_GetCalibInfo();

	CMD_Printf((uint8_t *)"\n\r\n\r");
	CMD_Printf((uint8_t *)"Calibration info: \n\r");
	CMD_Printf((uint8_t *)"\n\r");
	CMD_Printf((uint8_t *)"FS: %.04f [Hz]\n\r" , calib.sampling_frequency);

	CMD_Printf((uint8_t *)"\n\rPhase 1:\n\r");
	CMD_Printf((uint8_t *)"V_COEFF: %.04f\n\r" , calib.coeff.phase_r.vrms);
	CMD_Printf((uint8_t *)"I1_COEFF: %.04f\n\r" , calib.coeff.phase_r.irms);
	CMD_Printf((uint8_t *)"ACT1_COEFF: %.04f\n\r" , calib.coeff.phase_r.active_power);
	CMD_Printf((uint8_t *)"REA1_COEFF: %.04f\n\r" , calib.coeff.phase_r.reactive_power);
	CMD_Printf((uint8_t *)"APP1_COEFF: %.04f\n\r" , calib.coeff.phase_r.apparent_power);
	CMD_Printf((uint8_t *)"ANGLE0_1: %.04f [deg]\n\r" , calib.sw_phase_correction.phase_r.i_phase_degrees[0]);
	CMD_Printf((uint8_t *)"ANGLE1_1: %.04f [deg]\n\r" , calib.sw_phase_correction.phase_r.i_phase_degrees[1]);
	CMD_Printf((uint8_t *)"GAIN0_1: %.04f\n\r" , calib.sw_gain.phase_r.i_gain_values[0]);
	CMD_Printf((uint8_t *)"GAIN1_1: %.04f\n\r" , calib.sw_gain.phase_r.i_gain_values[1]);

	CMD_Printf((uint8_t *)"\n\rPhase 2:\n\r");
	CMD_Printf((uint8_t *)"V_COEFF: %.04f\n\r" , calib.coeff.phase_y.vrms);
	CMD_Printf((uint8_t *)"I1_COEFF: %.04f\n\r" , calib.coeff.phase_y.irms);
	CMD_Printf((uint8_t *)"ACT1_COEFF: %.04f\n\r" , calib.coeff.phase_y.active_power);
	CMD_Printf((uint8_t *)"REA1_COEFF: %.04f\n\r" , calib.coeff.phase_y.reactive_power);
	CMD_Printf((uint8_t *)"APP1_COEFF: %.04f\n\r" , calib.coeff.phase_y.apparent_power);
	CMD_Printf((uint8_t *)"ANGLE0_1: %.04f [deg]\n\r" , calib.sw_phase_correction.phase_y.i_phase_degrees[0]);
	CMD_Printf((uint8_t *)"ANGLE1_1: %.04f [deg]\n\r" , calib.sw_phase_correction.phase_y.i_phase_degrees[1]);
	CMD_Printf((uint8_t *)"GAIN0_1: %.04f\n\r" , calib.sw_gain.phase_y.i_gain_values[0]);
	CMD_Printf((uint8_t *)"GAIN1_1: %.04f\n\r" , calib.sw_gain.phase_y.i_gain_values[1]);

	CMD_Printf((uint8_t *)"\n\rPhase 3:\n\r");
	CMD_Printf((uint8_t *)"V_COEFF: %.04f\n\r" , calib.coeff.phase_b.vrms);
	CMD_Printf((uint8_t *)"I1_COEFF: %.04f\n\r" , calib.coeff.phase_b.irms);
	CMD_Printf((uint8_t *)"ACT1_COEFF: %.04f\n\r" , calib.coeff.phase_b.active_power);
	CMD_Printf((uint8_t *)"REA1_COEFF: %.04f\n\r" , calib.coeff.phase_b.reactive_power);
	CMD_Printf((uint8_t *)"APP1_COEFF: %.04f\n\r" , calib.coeff.phase_b.apparent_power);
	CMD_Printf((uint8_t *)"ANGLE0_1: %.04f [deg]\n\r" , calib.sw_phase_correction.phase_b.i_phase_degrees[0]);
	CMD_Printf((uint8_t *)"ANGLE1_1: %.04f [deg]\n\r" , calib.sw_phase_correction.phase_b.i_phase_degrees[1]);
	CMD_Printf((uint8_t *)"GAIN0_1: %.04f\n\r" , calib.sw_gain.phase_b.i_gain_values[0]);
	CMD_Printf((uint8_t *)"GAIN1_1: %.04f\n\r" , calib.sw_gain.phase_b.i_gain_values[1]);

	CMD_Printf((uint8_t *)"\n\rNeutral:\n\r");
	CMD_Printf((uint8_t *)"I1_COEFF: %.04f\n\r\n\r" , calib.coeff.neutral.irms);

	return 0;
}

/******************************************************************************
 * Function Name    : static uint8_t COMMAND_InvokeSetConfig(uint8_t *arg_str)
 * Description      : Command Invoke Set configuration
 * Arguments        : uint8_t *arg_str: Arguments string
 * Functions Called : None
 * Return Value     : uint8_t, execution code, 0 is success
 ******************************************************************************/
static uint8_t COMMAND_InvokeSetConfig(uint8_t *arg_str)
{
	EM_SW_PROPERTY FAR_PTR * config;         /* Configuration */

	/* Ack the lask received CMD */
	CMD_AckCmdReceivedNoHeader();

	/* Set current configuration */
	config = EM_SW_GetProperty();

	/* Display current information */
	CMD_SendString((uint8_t *)"\n\r Current configuration info:");
	CMD_Printf((uint8_t *)"\n\r - Voltage Sag Fall Threshold (V): %.01f", config->sag_swell.sag_rms_fall_threshold);
	CMD_Printf((uint8_t *)"\n\r - Voltage Sag Rise Threshold (V): %.01f", config->sag_swell.sag_rms_rise_threshold);
	CMD_Printf((uint8_t *)"\n\r - Voltage Swell Fall Threshold (V): %.01f", config->sag_swell.swell_rms_fall_threshold);
	CMD_Printf((uint8_t *)"\n\r - Voltage Swell Rise Threshold (V): %.01f", config->sag_swell.swell_rms_rise_threshold);

	CMD_Printf((uint8_t *)"\n\r - Rounding Digits Power: %d", config->rounding.power);
	CMD_Printf((uint8_t *)"\n\r - Rounding Digits RMS: %d", config->rounding.rms);
	CMD_Printf((uint8_t *)"\n\r - Rounding Digits Frequency: %d", config->rounding.freq);
	CMD_Printf((uint8_t *)"\n\r - Rounding Digits Power Factor: %d", config->rounding.pf);

	CMD_Printf((uint8_t *)"\n\r - I-rms No Load Threshold (A): %.01f", config->operation.irms_noload_threshold);
	CMD_Printf((uint8_t *)"\n\r - Power No Load Threshold (W): %.01f", config->operation.power_noload_threshold);
	CMD_Printf((uint8_t *)"\n\r - No Voltage Threshold (V): %.01f", config->operation.no_voltage_threshold);
	CMD_Printf((uint8_t *)"\n\r - Minimum Frequency (Hz): %.01f", config->operation.freq_low_threshold);
	CMD_Printf((uint8_t *)"\n\r - Maximum Frequency (Hz): %.01f", config->operation.freq_high_threshold);
	CMD_Printf((uint8_t *)"\n\r - Meter Constant (imp/KWh): %lu", config->operation.meter_constant);
	CMD_Printf((uint8_t *)"\n\r - Pulse On Time (ms): %.01f", config->operation.pulse_on_time);

	CMD_SendString((uint8_t *)"\n\r");

