lwray-renesas/Metrology_NPL_3Ph4W/src/rl78i1c/application/debug/command.c
	return 0;
}

/******************************************************************************
 * Function Name   : COMMAND_InvokeCPULoad
 * Interface       : static void COMMAND_InvokeCPULoad(uint8_t *arg_str)
 * Description     : Command Invoke Watch DSAD
 * Arguments       : uint8_t * arg_str: Arguments string
 * Function Calls  : None
 * Return Value    : None
 ******************************************************************************/
static uint8_t COMMAND_InvokeCPULoad(uint8_t *arg_str)
{
#ifdef METER_ENABLE_MEASURE_CPU_LOAD

	float max_dsad_time     = 0.0f;
	float min_dsad_time     = 0.0f;
	float avg_dsad_time     = 0.0f;
	EM_CALIBRATION calib    = EM_GetCalibInfo();
	uint16_t cpu_speed = 24;

	if(HOCODIV == 0x00)
	{
		cpu_speed = 24;
	}
	else if(HOCODIV == 0x01)
	{
		cpu_speed = 12;
	}
	else
	{
		cpu_speed = 6;
	}

	LOADTEST_TAU_Init();

	g_timer0_dsad_sum_counter = 0;
	g_timer0_dsad_maxcounter = 0;
	g_timer0_dsad_mincounter = 0xFFFF;
	g_dsad_count = 0;
	g_timer0_diff = 0;

	CMD_Printf((uint8_t *)"\n\r");
	CMD_Printf((uint8_t *)"\n\rStarted measuring DSAD functions performance");
	CMD_Printf((uint8_t *)"\n\rCPU Speed: %u MHz", cpu_speed);
	CMD_Printf((uint8_t *)"\n\rPlease wait for about %0.3f seconds while system measuring",(float)g_dsad_max_count * 0.000256f);
	while(g_dsad_count < g_dsad_max_count)
	{
		R_WDT_Restart();
	}

	/*
        Substract cycles not related to EM processing (from Timer start to Timer stop
            No need now
	 */
	g_timer0_dsad_maxcounter -= (0);

	max_dsad_time   = ((float)g_timer0_dsad_maxcounter      / (float)(LOADTEST_CGC_GetClock())) / 1000.0f;
	min_dsad_time   = ((float)g_timer0_dsad_mincounter      / (float)(LOADTEST_CGC_GetClock())) / 1000.0f;
	avg_dsad_time   = ((float)g_timer0_dsad_sum_counter     / ((float)(LOADTEST_CGC_GetClock()) * g_dsad_max_count)) / 1000.0f;

	CMD_Printf((uint8_t *)"\n\r-------------------------------------------");

	CMD_Printf((uint8_t *)"\n\r% -35s %00.3fus",
			"Max CPU time spent in DSAD:",
			max_dsad_time * 1e6f
	);

	CMD_Printf((uint8_t *)"\n\r% -35s %00.3f%%",
			"Max CPU Load in percentage:",
			((max_dsad_time * calib.sampling_frequency)*100.0f)
	);

	CMD_Printf((uint8_t *)"\n\r% -35s %00.3fus",
			"Min CPU time spent in DSAD:",
			min_dsad_time * 1e6f
	);

	CMD_Printf((uint8_t *)"\n\r% -35s %00.3f%%",
			"Min CPU Load in percentage:",
			((min_dsad_time * calib.sampling_frequency)*100.0f)
	);

	CMD_Printf((uint8_t *)"\n\r% -35s %00.3fus",
			"Average CPU time spent in DSAD:",
			avg_dsad_time * 1e6f
	);

	CMD_Printf((uint8_t *)"\n\r% -35s %00.3f%%",
			"Average CPU Load in percentage:",
			((avg_dsad_time * calib.sampling_frequency)*100.0f)
	);

	CMD_Printf((uint8_t *)"\n\r-------------------------------------------");

	LOADTEST_TAU_DeInit();

#else
	CMD_Printf((uint8_t *)"\n\r No support. please turn on the macro METER_ENABLE_MEASURE_CPU_LOAD! \n\r ");
#endif


	return 0;
}

/******************************************************************************
 * Function Name   : COMMAND_InvokeVddCheck
 * Interface       : static void COMMAND_InvokeVddCheck(uint8_t *arg_str)
 * Description     : Command Invoke VDD check on LVD
 * Arguments       : uint8_t * arg_str: Arguments string
 * Function Calls  : None
 * Return Value    : None
 ******************************************************************************/
static uint8_t COMMAND_InvokeVddCheck(uint8_t *arg_str)
{
	CMD_Printf((uint8_t*)"\n\rVDD Status: ");
	CMD_Printf((uint8_t*)R_LVD_range_to_str(R_LVD_Check()));
	CMD_SendString((uint8_t *)"\n\r");

	return 0;
}

/******************************************************************************
 * Function Name   : COMMAND_InvokeInvertPolarity
 * Interface       : static void COMMAND_InvokeInvertPolarity(uint8_t *arg_str)
 * Description     : Command Invoke Inver Polarity
 * Arguments       : uint8_t * arg_str: Arguments string
 * Function Calls  : None
 * Return Value    : None
 ******************************************************************************/
static uint8_t COMMAND_InvokeInvertPolarity(uint8_t *arg_str)
{
	uint8_t channel_to_invert;
	uint8_t buffer[20];

	CMD_SendString((uint8_t *)"\n\rParameter(s): ");
	CMD_SendString((uint8_t *)arg_str);
	CMD_SendString((uint8_t *)"\n\r");

	/* Get Day parameter */
	arg_str = COMMAND_GetScanOneParam(buffer, 20, arg_str, (uint8_t *)" ", (uint8_t *)" /");

	if (arg_str != NULL &&
			(buffer[0] >= '0' && buffer[0] <= '9'))
	{
		/* get number */
		channel_to_invert = (uint8_t)atoi((char * __near)buffer);

		if(1 == channel_to_invert)
		{
			CMD_SendString((uint8_t *)"Phase 1 inverted!\n\r");
			phase1_inversion_flag *= -1;
		}
		else if(2 == channel_to_invert)
		{
			CMD_SendString((uint8_t *)"Phase 2 inverted!\n\r");
			phase2_inversion_flag *= -1;
		}
		else if(3 == channel_to_invert)
		{
			CMD_SendString((uint8_t *)"Phase 3 inverted!\n\r");
			phase3_inversion_flag *= -1;
		}
		else if(4 == channel_to_invert)
		{
			CMD_SendString((uint8_t *)"Neutral inverted!\n\r");
			neutral_inversion_flag *= -1;
		}
		else
		{
			CMD_SendString((uint8_t *)"Parameter error\n\r");
			return 1;
		}
	}
	else
	{
		CMD_SendString((uint8_t *)"Parameter error\n\r");
		return 1;
	}

	return 0;
}

/******************************************************************************
 * Function Name : COMMAND_Init
 * Interface     : void COMMAND_Init(void)
 * Description   : Init the COMMAND application
 * Arguments     : None
 * Return Value  : None
 ******************************************************************************/
void COMMAND_Init(void)
{
	CMD_Init();
	CMD_RegisterSuggestion((void *)cmd_table, COMMAND_TABLE_LENGTH);
}

/***********************************************************************************************************************
 * Function Name    : void COMMAND_PollingProcessing(void)
 * Description      : COMMAND Polling Processing
 * Arguments        : None
 * Functions Called : None
 * Return Value     : None
 ***********************************************************************************************************************/
void COMMAND_PollingProcessing(void)
{
	uint8_t i, is_found_cmd;
	uint8_t *pstr, *p_strarg;
	uint8_t cmdstr[64];

	/* Processing command line */
	if (CMD_IsCmdReceived())
	{
		/* Get command */
		pstr = CMD_Get();
		memset(cmdstr, 0, 64);

		/* Skip all ahead space */
		while (pstr[0] == ' ' && pstr[0] != 0)
		{
			pstr++;
		}

		/* Get command name */
		i = 0;
		while (pstr[0] != ' ' && pstr[0] != 0)
		{
			cmdstr[i++] = *pstr;
			pstr++;
		}

		/* Skip all ahead space on argument list */
		while (pstr[0] == ' ' && pstr[0] != 0)
		{
			pstr++;
		}
		p_strarg = pstr;

		/* is end of string */
		if (p_strarg[0] == 0)
		{
			p_strarg = NULL;    /* No parameter */
		}

		/* Find to invoke the command on the cmd_table */
		if (cmdstr[0] != 0)
		{
			is_found_cmd = 0;       /* Not found */
			for (i = 0; i < COMMAND_TABLE_LENGTH; i++)
			{
				/* is matched? */
				if (strcmp((const char *)cmdstr, (const char *)cmd_table[i].cmd_name) == 0)
				{
					INVOKE_COMMAND(i, p_strarg);        /* Invoke to function */
					is_found_cmd = 1;                   /* Found command */
				}
			}

			/* is NOT found command? */
			if (!is_found_cmd)
			{
				CMD_SendString((uint8_t *)"\n\rUnknown command: [");
				CMD_SendString(CMD_Get());
				CMD_SendString((uint8_t *)"]\n\rType ? for command list\n\r");
			}
		}

		CMD_AckCmdReceived();
	}
}


#endif /* __DEBUG */
